nce2-4/L79.org
#+OPTIONS: \n:t toc:nil num:nil html-postamble:nil

* Lesson 79 By air 

#+begin_verse
Why did the plane turn back?

I used to travel by air *a great deal* when I was a boy.
My parents used to live in South America
	and I used to fly there from Europe in the holidays.
A flight attendant would *take charge of* me
	and I never had an unpleasant experience.
I *am used to travelling* by air
	and only on one occasion have I ever *felt frightened*.
After *taking off*, we were flying low over the city and slowly *gaining height*,
	when the plane suddenly turned round and flew back to the airport.
While we were waiting to land,
	a flight attendant told us to keep calm and to get off the plane quietly
		as soon as it had *touched down*.
Everybody *on board* was worried
	and we *were curious to find out* what had happened.
Later we learnt that there was a very important person on board.
The police had been told that *a bomb had been planted* on the plane.
After we had landed, the plane was searched thoroughly.
Fortunately, nothing was found
	and five hours later we were able to take off again.
#+end_verse

** words
parent [ˈperənt] n.父母亲
flight attendant [flaɪt-əˈtendənt] 空中乘务员
frightened [ˈfraɪt(ə)nd] adj.害怕,担惊
curious [ˈkjʊriəs] adj.急于了解,好奇的
bomb [bɑm] n.炸弹
plant [plænt] v.安放

** 单词造句
parent n.
1. As a parent, I could bear that he insists on smoking near my children.
2. My parents prevented me from living abroad.
3. My parents kept carrying corn stalks to my house.
4. After having an accident, my parents was trying to stay out of the limelight.
5. My parents should have sent a signal to me.
flight attendant 
1. All the flight attendants were put to shame by her.
2. In the meantime, the flight attendant refused to offer him a blanket and sneered at him.
3. The flight attendant took precaution so that nobody can recognize her.
4. The flight attendant can't arrive on such short notice.
5. The flight attendant is a huge fan of the rapper singer.
frightened adj. feel frightened
1. Would you mind my smoking there? I feel frightened.
2. When could I get out of here? I feel frightened a lot.
3. She feels frightened over and over again because of her husband's heavy drink.
4. It made me feel frightened that my grandfather was lying on the floor and talking rudely.
5. Don't be too hard on me. You made me feel frightened.
curious adj. sb. be curious to find out + ...
1. My wife is curious to find out whether I pass the exam.
2. I am curious to find out why you take precaution a great deal.
3. Mr. Leo is curious to find out who played truent from school last week.
4. I am curious to find out how she hitchhiked to NewYork.
5. I am curious to find out why my colleague is responsible for the undertake, not me.
bomb n. plant v. plant a bomb
1. He was disappointed to learn that the bomb had not been planted at the airport.
2. Following in his father footsteps, the gangster planted a bom in the railway station.
3. Having planted the bomb , he burnt down the house.
4. He double checked whether the bomb had been planted successfully.
5. In the tower, a bomb needn't have been planted.
** 反复听电影片段
** Pattern Drill 写+读
** 给自己讲解
** 红皮书
** 习惯用法造句
a great deal
1. The beauty of the West Lake is beyond description a great deal.
2. He worked hard a great deal to get a better salary. 
3. He is sensitive about accepting criticism a great deal.
4. I shouldn't have lost my temper a great deal.
5. He has finished his housework a great deal.
take charge of
1. Mr. Leo asked me to take charge of the class while he was away. 
2. I was instructed to take charge of those cows.
3. Let's suppose that you are taking charge of the boy who play truent from school.
4. I have been taking charge of the baby. She says with a sneer.
5. I am pleased with taking charge of the cute cat.
be used to doing
1. I am used to reading aloud in the afternoon.
2. I am used to following my cousin around all weekends.
3. He is used to stealing his aunt's books.
4. He was used to setting up camps when he was very young.
5. I am not used to cooking dinner.
take off
1. The helicopter is taking off in the field.
2. The helicopter took off suddenly at the airport.
3. Before it had taken off, the plane was double checked.
4. It is no use pretending that the plane had taken off.
5. He noticed that the plane had not taken off.
gain height
1. The plane failed to gain height.
2. The plane managed to gain height in such terrible condition.
3. The plane gained height when it crossed the forest.
4. The plane is gaining height on the way home.
5. The plane would gain height as soon as it takes off.
touch down
1. When the plane touch down, a party of detectives were waiting at the airport.
2. After touching off, the plane was covered with a big blanket.
3. The moment the plane touches down, you will be arrested.
4. It is said that the plane touched down in the field.
5. The plane was said to touch down in the area.
on board
1. The moment you are on board, the flight attendant will offer you some foods.
2. The passenger on board has the nevers to ask for the flight attendant's phonenumber.
3. The girl was taken charge of a flight attendant on board.
4. I'm fairly confident that I am king of the world when I am on board.
5. The captain would be on board in his thirties.
** 跟读至背诵
** Ask me if 写+读
** 摘要写作
** tell the story 口语
** Topics for discussion

