nce2-4/L79.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-09-17 Sun 12:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="DESKTOP-13B7HQM" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">

<div id="outline-container-org594a53e" class="outline-2">
<h2 id="org594a53e">Lesson 79 By air</h2>
<div class="outline-text-2" id="text-org594a53e">
<p class="verse">
Why did the plane turn back?<br />
<br />
I used to travel by air <b>a great deal</b> when I was a boy.<br />
My parents used to live in South America<br />
&#xa0;and I used to fly there from Europe in the holidays.<br />
A flight attendant would <b>take charge of</b> me<br />
&#xa0;and I never had an unpleasant experience.<br />
I <b>am used to travelling</b> by air<br />
&#xa0;and only on one occasion have I ever <b>felt frightened</b>.<br />
After <b>taking off</b>, we were flying low over the city and slowly <b>gaining height</b>,<br />
&#xa0;when the plane suddenly turned round and flew back to the airport.<br />
While we were waiting to land,<br />
&#xa0;a flight attendant told us to keep calm and to get off the plane quietly<br />
&#xa0;&#xa0;as soon as it had <b>touched down</b>.<br />
Everybody <b>on board</b> was worried<br />
&#xa0;and we <b>were curious to find out</b> what had happened.<br />
Later we learnt that there was a very important person on board.<br />
The police had been told that <b>a bomb had been planted</b> on the plane.<br />
After we had landed, the plane was searched thoroughly.<br />
Fortunately, nothing was found<br />
&#xa0;and five hours later we were able to take off again.<br />
</p>
</div>

<div id="outline-container-org9564a04" class="outline-3">
<h3 id="org9564a04">words</h3>
<div class="outline-text-3" id="text-org9564a04">
<p>
parent [ˈperənt] n.父母亲<br />
flight attendant [flaɪt-əˈtendənt] 空中乘务员<br />
frightened [ˈfraɪt(ə)nd] adj.害怕,担惊<br />
curious [ˈkjʊriəs] adj.急于了解,好奇的<br />
bomb [bɑm] n.炸弹<br />
plant [plænt] v.安放<br />
</p>
</div>
</div>

<div id="outline-container-org92aea1c" class="outline-3">
<h3 id="org92aea1c">单词造句</h3>
<div class="outline-text-3" id="text-org92aea1c">
<p>
parent n.<br />
</p>
<ol class="org-ol">
<li>As a parent, I could bear that he insists on smoking near my children.<br /></li>
<li>My parents prevented me from living abroad.<br /></li>
<li>My parents kept carrying corn stalks to my house.<br /></li>
<li>After having an accident, my parents was trying to stay out of the limelight.<br /></li>
<li>My parents should have sent a signal to me.<br /></li>
</ol>
<p>
flight attendant<br />
</p>
<ol class="org-ol">
<li>All the flight attendants were put to shame by her.<br /></li>
<li>In the meantime, the flight attendant refused to offer him a blanket and sneered at him.<br /></li>
<li>The flight attendant took precaution so that nobody can recognize her.<br /></li>
<li>The flight attendant can't arrive on such short notice.<br /></li>
<li>The flight attendant is a huge fan of the rapper singer.<br /></li>
</ol>
<p>
frightened adj. feel frightened<br />
</p>
<ol class="org-ol">
<li>Would you mind my smoking there? I feel frightened.<br /></li>
<li>When could I get out of here? I feel frightened a lot.<br /></li>
<li>She feels frightened over and over again because of her husband's heavy drink.<br /></li>
<li>It made me feel frightened that my grandfather was lying on the floor and talking rudely.<br /></li>
<li>Don't be too hard on me. You made me feel frightened.<br /></li>
</ol>
<p>
curious adj. sb. be curious to find out + &#x2026;<br />
</p>
<ol class="org-ol">
<li>My wife is curious to find out whether I pass the exam.<br /></li>
<li>I am curious to find out why you take precaution a great deal.<br /></li>
<li>Mr. Leo is curious to find out who played truent from school last week.<br /></li>
<li>I am curious to find out how she hitchhiked to NewYork.<br /></li>
<li>I am curious to find out why my colleague is responsible for the undertake, not me.<br /></li>
</ol>
<p>
bomb n. plant v. plant a bomb<br />
</p>
<ol class="org-ol">
<li>He was disappointed to learn that the bomb had not been planted at the airport.<br /></li>
<li>Following in his father footsteps, the gangster planted a bom in the railway station.<br /></li>
<li>Having planted the bomb , he burnt down the house.<br /></li>
<li>He double checked whether the bomb had been planted successfully.<br /></li>
<li>In the tower, a bomb needn't have been planted.<br /></li>
</ol>
</div>
</div>
<div id="outline-container-orgfc28e86" class="outline-3">
<h3 id="orgfc28e86">反复听电影片段</h3>
</div>
<div id="outline-container-org1e39b0e" class="outline-3">
<h3 id="org1e39b0e">Pattern Drill 写+读</h3>
</div>
<div id="outline-container-org08ca46f" class="outline-3">
<h3 id="org08ca46f">给自己讲解</h3>
</div>
<div id="outline-container-org0300148" class="outline-3">
<h3 id="org0300148">红皮书</h3>
</div>
<div id="outline-container-orgfacfdaf" class="outline-3">
<h3 id="orgfacfdaf">习惯用法造句</h3>
<div class="outline-text-3" id="text-orgfacfdaf">
<p>
a great deal<br />
</p>
<ol class="org-ol">
<li>The beauty of the West Lake is beyond description a great deal.<br /></li>
<li>He worked hard a great deal to get a better salary.<br /></li>
<li>He is sensitive about accepting criticism a great deal.<br /></li>
<li>I shouldn't have lost my temper a great deal.<br /></li>
<li>He has finished his housework a great deal.<br /></li>
</ol>
<p>
take charge of<br />
</p>
<ol class="org-ol">
<li>Mr. Leo asked me to take charge of the class while he was away.<br /></li>
<li>I was instructed to take charge of those cows.<br /></li>
<li>Let's suppose that you are taking charge of the boy who play truent from school.<br /></li>
<li>I have been taking charge of the baby. She says with a sneer.<br /></li>
<li>I am pleased with taking charge of the cute cat.<br /></li>
</ol>
<p>
be used to doing<br />
</p>
<ol class="org-ol">
<li>I am used to reading aloud in the afternoon.<br /></li>
<li>I am used to following my cousin around all weekends.<br /></li>
<li>He is used to stealing his aunt's books.<br /></li>
<li>He was used to setting up camps when he was very young.<br /></li>
<li>I am not used to cooking dinner.<br /></li>
</ol>
<p>
take off<br />
</p>
<ol class="org-ol">
<li>The helicopter is taking off in the field.<br /></li>
<li>The helicopter took off suddenly at the airport.<br /></li>
<li>Before it had taken off, the plane was double checked.<br /></li>
<li>It is no use pretending that the plane had taken off.<br /></li>
<li>He noticed that the plane had not taken off.<br /></li>
</ol>
<p>
gain height<br />
</p>
<ol class="org-ol">
<li>The plane failed to gain height.<br /></li>
<li>The plane managed to gain height in such terrible condition.<br /></li>
<li>The plane gained height when it crossed the forest.<br /></li>
<li>The plane is gaining height on the way home.<br /></li>
<li>The plane would gain height as soon as it takes off.<br /></li>
</ol>
<p>
touch down<br />
</p>
<ol class="org-ol">
<li>When the plane touch down, a party of detectives were waiting at the airport.<br /></li>
<li>After touching off, the plane was covered with a big blanket.<br /></li>
<li>The moment the plane touches down, you will be arrested.<br /></li>
<li>It is said that the plane touched down in the field.<br /></li>
<li>The plane was said to touch down in the area.<br /></li>
</ol>
<p>
on board<br />
</p>
<ol class="org-ol">
<li>The moment you are on board, the flight attendant will offer you some foods.<br /></li>
<li>The passenger on board has the nevers to ask for the flight attendant's phonenumber.<br /></li>
<li>The girl was taken charge of a flight attendant on board.<br /></li>
<li>I'm fairly confident that I am king of the world when I am on board.<br /></li>
<li>The captain would be on board in his thirties.<br /></li>
</ol>
</div>
</div>
<div id="outline-container-orgf06a26b" class="outline-3">
<h3 id="orgf06a26b">跟读至背诵</h3>
</div>
<div id="outline-container-org4071301" class="outline-3">
<h3 id="org4071301">Ask me if 写+读</h3>
</div>
<div id="outline-container-org2de9811" class="outline-3">
<h3 id="org2de9811">摘要写作</h3>
</div>
<div id="outline-container-org99b67f7" class="outline-3">
<h3 id="org99b67f7">tell the story 口语</h3>
</div>
<div id="outline-container-orgf174e9b" class="outline-3">
<h3 id="orgf174e9b">Topics for discussion</h3>
</div>
</div>
</div>
</body>
</html>
